# Using pikaur or paru or yay
ani-cli
auto-cpufreq
betterlockscreen
catppuccin-cursors-mocha 
catppuccin-gtk-theme-mocha 
font-config-info-git  
goanime
jre 
julia-bin
kvantum-theme-catppuccin-git
light
manga-tui
mkinitcpio-firmware
numix-icon-theme-git 
oh-my-posh
onedrive-abraunegg 
phinger-cursors
python-pyqt5-3 
python-pyqt5-chart 
python-pyqt5-datavisualization
python-pyqt5-networkauth
python-pyqt5-purchasing 
python-pyrsistent
qt5-gamepad 
qt5-lottie
qt5-purchasing
qt5-quicktimeline
qt5-serialbus
qt5-webglplugin
qt5-webview
shell-color-scripts
stremio
ttf-icomoon-feather
ttf-ms-win11-auto
yay
zen-browser-avx2-bin
