# Using pikaur or paru or yay
aic94xx-firmware
ani-cli
ast-firmware
auto-cpufreq
betterlockscreen
catppuccin-cursors-mocha 
catppuccin-gtk-theme-mocha 
font-config-info-git 
font-config-info-git-debug 
goanime 
goanime-debug 
httpdirfs
httpdirfs-debug 
httpfs2-2gbplus 
httpfs2-2gbplus-debug
i3lock-color
i3lock-color-debug
jre 
julia-bin
kvantum-theme-catppuccin-git
light
light-debug
manga-tui
manga-tui-debug 
mkinitcpio-firmware
multimc-bin-debug
numix-icon-theme-git 
oh-my-posh
oh-my-posh-debug 
onedrive-abraunegg 
onedrive-abraunegg-debug 
phinger-cursors
python-pyqt5-3d 
python-pyqt5-chart 
python-pyqt5-datavisualization
python-pyqt5-networkauth
python-pyqt5-purchasing 
python-pyrsistent
qt5-gamepad 
qt5-gamepad-debug
qt5-lottie
qt5-lottie-debug
qt5-purchasing
qt5-purchasing-debug
qt5-quicktimeline
qt5-quicktimeline-debug
qt5-serialbus
qt5-webglplugin
qt5-webglplugin-debug
qt5-webview
qt5-webview-debug
shell-color-scripts
shell-color-scripts-git
stremio
stremio-debug
ttf-icomoon-feather
ttf-ms-win11-auto
upd72020x-fw
wd719x-firmware
yay
yay-debug
zen-browser-avx2-bin
