# First enable multilib, paralell downloads and ILoveCandy pplssssssssss.
# Base system install
pakstrap -K /mnt base linux linux-firmware sof-firmware (for laptops after 2019) intel-ucode(ou adm-ucode) nano neovim networkmanager man-db man-pages texinfo doxygen


#Boot, processor
intel-ucode
grub
efibootmgr
os-prober
dosfstools

# Audio (pulse_audio, jack and alsa are old envs)
pipewire
wireplumber
pipewire-alsa
pipewire-pulse
pipewire-jack
pavucontrol

# Connectivity
dhcpcd
networkmanager
network-manager-applet
nm-connection-editor
firewalld
curl
wget
wpa_supplicant
openssh
git
github-cli
cups
sane
sane-airscan
hplip
print-manager
skanlite
openresolv
gvfs
openvpn
networkmanager-openvpn
net-tools

# Bluetooth
bluez
bluez-utils
bluedevil
bluez-libs

#Programs and for programming
base-devel
firefox 
calibre 
bitwarden
btop
discord
qbittorrent
obs-studio
kitty
neovim
libreoffice-fresh
gimp
nano
chromium
doxygen
timeshift
man
man-utils
krita
steam
gnome-calculator

# Usability for WM standalone
picom
bash-completion
sxhkd
numlockx
flameshot
pavucontrol
mkinitcpio-firmware
zsh
lightdm
fzf
polybar
xarchiver
fastfetch
chafa
partitionmanager
qt5
qt6
qt5ct
qt6ct
pyqt5
dunst
ripgrep
smartmontools
unrar 
unzip
xapp
xclip
xorg
ntfs-3g
feh
bzip2
pcmanfm
lm_sensors
okular
ebook-tools
e2fsprogs
exfatprogs
btrfs-progs
lxappearance
kvantum
polkit-kde-agent
polkit-qt5
polkit-qt6
print-manager
udisks2
mesa
xf86-video-intel
xkeyboard-config
xdg-user-dirs
xdg-utils
libinput
libnotify
libnma-gtk4
gtk2
gtk3
gtk4
gzip
rsync
xss-lock
eza
zip
reflector
rofi

#Fonts you possibly gonna use (choose what you want please)
font-manager
nerd-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
noto-fonts
ttf-hack
ttf-dejavu
ttf-droid
ttf-inconsolata
ttf-liberation
ttf-joypixels
ttf-indic-otf
ttf-roboto
ttf-ubuntu-font-family

#Latex dependencies
biber
texlive-basic
texlive-latex
texlive-latexrecommended
texlive-latexextra
texlive-binextra
texlive-bibtexextra
texlive-fontsrecommended
texlive-fontsextra
texlive-fontutils
texlive-langcyrillic
texlive-langportuguese
texlive-formatsextra
texlive-mathscience
texlive-publishers
texlive-humanities
texlive-pictures
texlive-pstricks

#Virtual Machine
virtualbox
virtualbox-guest-iso
qemu-full
libvirt
iptables
dnsmasq
openbsd-netcat
bridge-utils
virt-manager
x11-ssh-askpass

# Icons
arc-gtk-theme
breeze
breeze-gtk
libappindicator-gtk3
papirus-icon-theme
arc-icon-theme

