# First enable multilib, paralell downloads and ILoveCandy pplssssssssss.
#Boot and processor
intel-ucode
grub
efibootmgr
os-prober
dosfstools

# Audio (pulse_audio, jack and alsa are old envs)
pipewire
wireplumber
pipewire-alsa
pipewire-pulse
pipewire-jack
pavucontrol

# Connectivity and Functionality
dhcpcd
networkmanager
network-manager-applet
nm-connection-editor
firewalld
curl
wget
openssh
git
github-cli
cups
hplip
openresolv
openvpn
networkmanager-openvpn
python-pynvim
xdg-user-dirs
tree-sitter-cli
feh
pcmanfm
pavucontrol
playerctl

# Bluetooth
bluez
bluez-utils

#Programs and for programming
base-devel
firefox 
calibre 
bitwarden
htop
kitty
neovim
libreoffice-fresh
gimp
nano
numlockx
feh
xfce4-screenshooter
bzip2
pcmanfm
lm_sensors
okular
lxappearence
polkit-kde-agent
print-manager
udisks2
unzip
xarchiver
xf86-video-intel #preferably mesa instead#
xf86-video-vesa
xf86-input-synaptics
xf86-input-libinput
xkeyboard-config
xdg-user-dirs
libnma-gtk4
picom
zsh
qbittorrent
qt5
ripgrep
unrar 
xapp
xclip
xorg
ntfs-3g
pyqt5




#Fonts you possibly gonna use
font-manager
nerd-fonts
noto-fonts
ttf-hack-nerd
ttf-meslo-nerd
awesome-terminal-fonts
ttf-dejavu
ttf-droid
ttf-inconsolata
ttf-liberation
ttf-indic-otf
ttf-roboto
ttf-hack
ttf-ubuntu-font-family

For install nerd-fonts noto-fonts ttf-hack-nerd ttf-meslo-nerd awesome-terminal-fonts ttf-dejavu ttf-droid ttf-inconsolata ttf-liberation ttf-joypixels ttf-indic-otf ttf-roboto ttf-hack ttf-ubuntu-font-family

#Latex dependencies
biber
texlive-basic
texlive-latex
texlive-latexrecommended
texlive-latexextra
texlive-binextra
texlive-bibtexextra
texlive-fontsrecommended
texlive-fontsextra
texlive-fontutils
texlive-langcyrillic
texlive-langportuguese
texlive-formatsextra
texlive-mathscience
texlive-publishers
texlive-humanities
texlive-pictures
texlive-pstricks

# For install biber texlive-basic texlive-latex texlive-latexrecommended texlive-latexextra texlive-binextra texlive-bibtexextra texlive-fontsrecommended texlive-fontsextra texlive-fontutils texlive-langcyrillic texlive-langportuguese texlive-formatsextra texlive-mathscience texlive-publishers texlive-humanities texlive-pictures texlive-pstricks

# Icons
adwaita
breeze
libappindicator-gtk3
network-manager-applet
nm-connection-editor
notification-daemon
oxygen
oxygen-icons
papirus-icon-theme
