# wm usability
brightnessctl
xdg-user-dirs
waybar
wl-clipboard
lib-notify
hyprpaper
pavucontrol
dunst
qt5-wayland 
qt6-wayland

# programs
bash-completion
bitwarden
eza
fd
git
github-cli
luarocks
node-js
partitionmanager
python-pynvim
unzip
tree-sitter-cli
zsh

# file support
dosfstools
exfat-utils
fatresize
ntfs-3g

# fonts
otf-font-awesome
ttf-hack
nerd-fonts
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
ttf-dejavu
ttf-droid
ttf-inconsolata
ttf-liberation
ttf-joypixels
ttf-indic-otf
ttf-roboto

# latex pkgs
biber texlive-basic texlive-latex texlive-latexrecommended
texlive-latexextra texlive-binextra texlive-bibtexextra 
texlive-fontsrecommended texlive-fontsextra texlive-fontutils
texlive-langcyrillic texlive-langportuguese texlive-formatsextra
texlive-mathscience texlive-publishers texlive-humanities
texlive-pictures texlive-pstricks
