#Boot and processor
intel-ucode
grub
efibootmgr
os-prober
dosfstools

#Audio
pipewire
wireplumber
pipewire-alsa
pipewire-pulse
pipewire-jack

#Connectivity
dhcpcd
networkmanager
network-manager-applet
nm-connection-editor
firewalld
curl
wget
openssh
git
github-cli

#Bluetooth
bluez
bluez-utils

#Programs and for programming
firefox 
emacs
calibre 
openvpn
anaconda (por fora, desconsiderar)
bitwarden
julia
clion (from source)
spyder (from anaconda)

# For i3 functionality
redshit
xf86-input-libinput
numlockx
lm_sensors
mtools
util-linux
unrar
unzip
tmux
btop
htop
xclip
exa
bat
man-db
man-pages
neofetch
texinfo

#Fonts used
font-manager
nerd-fonts
noto-fonts
ttf-hack-nerd
ttf-meslo-nerd
awesome-terminal-fonts
ttf-dejavu
ttf-droid
ttf-inconsolata
ttf-liberation
ttf-joypixels
ttf-indic-otf
ttf-roboto
ttf-hack
ttf-ubuntu-font-family

#Latex base
biber
texlive-basic
texlive-latex
texlive-latexrecommended
texlive-latexextra
texlive-binextra
texlive-bibtexextra
texlive-fontsrecommended
texlive-fontsextra
texlive-fontutils
texlive-langcyrillic
texlive-langportuguese
texlive-formatsextra
texlive-mathscience
texlive-publishers
texlive-humanities
texlive-pictures
texlive-pstricks
