# First enable multilib, paralell downloads and ILoveCandy pplssssssssss.
#Boot and processor
intel-ucode
grub
efibootmgr
os-prober
dosfstools

#Audio (pulse_audio, jack and alsa are old envs)
pipewire
wireplumber
pipewire-alsa
pipewire-pulse
pipewire-jack

#Connectivity
dhcpcd
networkmanager
network-manager-applet
nm-connection-editor
firewalld
curl
wget
openssh
git
github-cli
cups

#Bluetooth
bluez
bluez-utils

#Programs and for programming
base-devel
firefox 
emacs
calibre 
openvpn
bitwarden
htop
btop
obs-studio
alacritty
spectacle
libreoffice-fresh
gimp
timeshift


#Fonts you possibly gonna use
font-manager
nerd-fonts
noto-fonts
ttf-hack-nerd
ttf-meslo-nerd
awesome-terminal-fonts
ttf-dejavu
ttf-droid
ttf-inconsolata
ttf-liberation
ttf-joypixels
ttf-indic-otf
ttf-roboto
ttf-hack
ttf-ubuntu-font-family


#Latex dependencies
biber
texlive-basic
texlive-latex
texlive-latexrecommended
texlive-latexextra
texlive-binextra
texlive-bibtexextra
texlive-fontsrecommended
texlive-fontsextra
texlive-fontutils
texlive-langcyrillic
texlive-langportuguese
texlive-formatsextra
texlive-mathscience
texlive-publishers
texlive-humanities
texlive-pictures
texlive-pstricks

#Virtual Machine
virtualbox
virtualbox-guest-iso
qemu
libvirt
iptables
dnsmasq
openbsd-netcat
bridge-utils
virt-manager


Post install

Install ohmyzsh
github-clie
iptables-nft
neofetch
discord
Clion (from source)
Spyder (from miniconda)

# For python support on Emacs (lsp-mode)
sudo pacman -S python-lsp-server
sudo pacman -S --asdeps python-mccabe python-pycodestyle python-pyflakes python-pylint yapf python-whatthepatch flake8 python-rope python-pydocstyle

